#### RepeaterCoordinates Members

---

|  |
| --- |
| RepeaterCoordinates Class   Constructors   Methods   Properties   See Also |

The  RepeaterCoordinates  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | RepeaterCoordinates | Creates zero dimensional coordinates. |
| Public method | RepeaterCoordinates(Int32) | Creates one dimensional coordinates. |
| Public method | RepeaterCoordinates(Int32, Int32) | Creates two dimensional coordinates. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Releases all resources used by the  RepeaterCoordinates |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetCoordinate | Returns the coordinate in the given dimension. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | DimensionCount | The number of dimensions of the coordinates (0, 1 or 2 for zero, one or two dimensional arrays.) |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

RepeaterCoordinates Class

Autodesk.Revit.DB Namespace